DataProcessors/ОткрытиеМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОткрытиеМагазинов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОткрытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТоваровВАссортименте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПомощникПоРознице</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециалистПоРазвитию</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МагазинНеСдан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Территория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовностьМагазина</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УправляющийРозницей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РуководительПоСтроительству</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПолейФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МагазиныПереданныеВРозницу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОткрытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТоваровВАссортименте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПомощникПоРознице</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпециалистПоРазвитию</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МагазинНеСдан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Территория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГотовностьМагазина</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УправляющийРозницей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РуководительПоСтроительству</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиОткрытияМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОткрытияМагазинов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеТипРолиПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекОткрытияМагазина</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастраеваемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНастроекОткрытияМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНастроекОткрытияМагазина</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсключенияУправляющийРозницей_ПомощникПоРаскрутке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретРедактирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольЗаполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольЗаполненияДляВсехЗаИсключением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретРедактированияДляВсехЗаИсключением</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОткрытиеМагазинов/Forms/НастройкаФормыСозданияНовогоМагазина/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСписок()
	Объект.НастройкиПолейФормы.Очистить();
	//+++АК SUVV 2018.03.05 ИП-00017818
	//Форма = Справочники.СтруктурныеЕдиницы.ПолучитьФорму("НовыйМагазин");
	Форма = ПолучитьФорму("Справочник.СтруктурныеЕдиницы.Форма.НовыйМагазин");
	//---АК SUVV
	Для каждого Элемент из Форма.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			НоваяСтрока = Объект.НастройкиПолейФормы.Добавить();
			НоваяСтрока.Поле = Элемент.Имя;
		КонецЕсли;
	КонецЦикла;

	//Отбор = Новый Структура;
	//Отбор.Вставить("КлючОбъекта","Справочник.СтруктурныеЕдиницы.Форма.НовыйМагазин");
	//ВыборкаНастроек = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	//Если ВидНастройки = "КонтрольЗаполнения" Тогда
	//	СтрКлючНастроек = "_КонтрольЗаполнения";	
	//ИначеЕсли ВидНастройки = "ЗапретРедактирования" Тогда
	//	СтрКлючНастроек = "_ЗапретРедактирования";
	//КонецЕсли;
	//Пока ВыборкаНастроек.Следующий() Цикл
	//	Если Найти(ВыборкаНастроек.КлючНастроек, СтрКлючНастроек) <> 0 Тогда
	//		ПараметрыОтбора = Новый Структура;
	//		ПараметрыОтбора.Вставить("Поле", СтрЗаменить(ВыборкаНастроек.КлючНастроек, СтрКлючНастроек,""));
	//		НайденныеСтроки = Объект.НастройкиПолейФормы.НайтиСтроки(ПараметрыОтбора);
	//		Для каждого Стр из НайденныеСтроки Цикл
	//			Стр.Значение = ВыборкаНастроек.Настройки;
	//			Если ЗначениеЗаполнено(Стр.Пользователи) Тогда
	//				Стр.Пользователи = Стр.Пользователи + ", " + ВыборкаНастроек.Пользователь;
	//			Иначе
	//				Стр.Пользователи = ВыборкаНастроек.Пользователь;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЦикла;
	//Объект.НастройкиПолейФормы.Сортировать("Поле");
	//+++АК SUVV 2018.03.05 ИП-00017818
	УстановитьПользователей();
	//Запрос = новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	НастройкиОткрытияМагазинов.НастраеваемыйОбъект КАК Поле,
	//               |	НастройкиОткрытияМагазинов.Значение КАК Пользователи
	//               |ИЗ
	//               |	РегистрСведений.НастройкиОткрытияМагазинов КАК НастройкиОткрытияМагазинов
	//               |ГДЕ
	//               |	НастройкиОткрытияМагазинов.ВидНастройки = &ВидНастройки";
	//Запрос.УстановитьПараметр("ВидНастройки", ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки));
	//ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	//Пока ВыборкаНастроек.Следующий() Цикл
	//	ПараметрыОтбора = Новый Структура;
	//	ПараметрыОтбора.Вставить("Поле", ВыборкаНастроек.Поле);
	//	НайденныеСтроки = Объект.НастройкиПолейФормы.НайтиСтроки(ПараметрыОтбора);
	//		Для каждого Стр из НайденныеСтроки Цикл
	//			Стр.Пользователи = ВыборкаНастроек.Пользователи;
	//		КонецЦикла;
	//КонецЦикла;
	//Запрос.УстановитьПараметр("ВидНастройки", ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки + "ДляВсехЗаИсключением"));
	//ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	//Пока ВыборкаНастроек.Следующий() Цикл
	//	ПараметрыОтбора = Новый Структура;
	//	ПараметрыОтбора.Вставить("Поле", ВыборкаНастроек.Поле);
	//	НайденныеСтроки = Объект.НастройкиПолейФормы.НайтиСтроки(ПараметрыОтбора);
	//		Для каждого Стр из НайденныеСтроки Цикл
	//			Стр.Пользователи = ВыборкаНастроек.Пользователи;
	//			Стр.Значение = Истина;
	//		КонецЦикла;
	//КонецЦикла;
	//---АК SUVV
	Объект.НастройкиПолейФормы.Сортировать("Поле");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидНастройки = "КонтрольЗаполнения";
	ЗаполнитьСписок();	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)	
	СохранитьНастройкиНаСервере();		
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	НачатьТранзакцию();
	//Удалим текущие настройки
	//Отбор = Новый Структура;
	//Отбор.Вставить("КлючОбъекта","Справочник.СтруктурныеЕдиницы.Форма.НовыйМагазин");
	//ВыборкаНастроек = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	//Пока ВыборкаНастроек.Следующий() Цикл
	//	Если Найти(ВыборкаНастроек.КлючНастроек, "_КонтрольЗаполнения") <> 0 Тогда
	//		ХранилищеСистемныхНастроек.Удалить("Справочник.СтруктурныеЕдиницы.Форма.НовыйМагазин",ВыборкаНастроек.КлючНастроек,ВыборкаНастроек.Пользователь);	
	//	КонецЕсли;	
	//КонецЦикла;
	////Запишем новые
	//Если ВидНастройки = "КонтрольЗаполнения" Тогда
	//	СтрКлючНастроек = "_КонтрольЗаполнения";	
	//ИначеЕсли ВидНастройки = "ЗапретРедактирования" Тогда
	//	СтрКлючНастроек = "_ЗапретРедактирования";
	//КонецЕсли;
	//Для каждого Стр из Объект.НастройкиПолейФормы цикл	
	//	Если ЗначениеЗаполнено(Стр.Пользователи) Тогда
	//		Если Найти(Стр.Пользователи,", ") <> 0 Тогда
	//			ТекстПользователи = СтрЗаменить(Стр.Пользователи,", ",Символы.ПС);
	//			Для НомСтр = 1 По СтрЧислоСтрок(ТекстПользователи) Цикл
	//				ХранилищеСистемныхНастроек.Сохранить("Справочник.СтруктурныеЕдиницы.Форма.НовыйМагазин","" + СТр.Поле + СтрКлючНастроек, Стр.Значение,,СокрЛП(СтрПолучитьСТроку(ТекстПользователи, НомСтр)));
	//			КонецЦикла;
	//		Иначе
	//			ХранилищеСистемныхНастроек.Сохранить("Справочник.СтруктурныеЕдиницы.Форма.НовыйМагазин","" + СТр.Поле + СтрКлючНастроек, Стр.Значение,,Стр.Пользователи);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;	
	//Удалим текущие настройки
	НаборЗаписей = РегистрыСведений.НастройкиОткрытияМагазинов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидНастройки.Установить(ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки));
	НаборЗаписей.Записать();
	
	//Запишем новые  
	ТЗ = новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидНастройки");
	ТЗ.Колонки.Добавить("НастраеваемыйОбъект");
	ТЗ.Колонки.Добавить("Значение");
	Для каждого Стр из Объект.НастройкиПолейФормы цикл	
		Если ЗначениеЗаполнено(Стр.Пользователи) И НЕ Стр.Значение Тогда
			НовСтрока = ТЗ.Добавить();
			НовСтрока.ВидНастройки = ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки);
			НовСтрока.НастраеваемыйОбъект = Стр.Поле;
			НовСтрока.Значение = Стр.Пользователи;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Загрузить(ТЗ);
	НаборЗаписей.Записать();
	
	//Удалим текущие настройки
	НаборЗаписей = РегистрыСведений.НастройкиОткрытияМагазинов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидНастройки.Установить(ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки + "ДляВсехЗаИсключением"));
	НаборЗаписей.Записать();
	
	//Запишем новые  
	ТЗ = новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидНастройки");
	ТЗ.Колонки.Добавить("НастраеваемыйОбъект");
	ТЗ.Колонки.Добавить("Значение");
	Для каждого Стр из Объект.НастройкиПолейФормы цикл	
		Если ЗначениеЗаполнено(Стр.Пользователи) И Стр.Значение Тогда
			НовСтрока = ТЗ.Добавить();
			НовСтрока.ВидНастройки = ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки + "ДляВсехЗаИсключением");
			НовСтрока.НастраеваемыйОбъект = Стр.Поле;
			НовСтрока.Значение = Стр.Пользователи;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Загрузить(ТЗ);
	НаборЗаписей.Записать();

	ЗафиксироватьТранзакцию();
КонецПроцедуры	

&НаКлиенте
Процедура НастройкиПолейФормыПользователиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.НастройкиПолейФормы.ТекущиеДанные;	
	СтандартнаяОбработка = Ложь;
	П = Новый Структура;
	П.Вставить("Пользователи", Элемент.ТекстРедактирования);
	ТекущиеДанные.Пользователи = ОткрытьФормуМодально("Обработка.ОткрытиеМагазинов.Форма.ФормаВыбораПользователей",П, Элемент);	
КонецПроцедуры


&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	ЗаполнитьСписок();
КонецПроцедуры
//+++АК SUVV 2018.03.05 ИП-00017818
&НаСервере
Процедура УстановитьПользователей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиОткрытияМагазинов.НастраеваемыйОбъект КАК Поле,
	|	НастройкиОткрытияМагазинов.Значение КАК Пользователи
	|ИЗ
	|	РегистрСведений.НастройкиОткрытияМагазинов КАК НастройкиОткрытияМагазинов
	|ГДЕ
	|	НастройкиОткрытияМагазинов.ВидНастройки = &ВидНастройки";
	Запрос.УстановитьПараметр("ВидНастройки", ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки));
	ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНастроек.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Поле", ВыборкаНастроек.Поле);
		НайденныеСтроки = Объект.НастройкиПолейФормы.НайтиСтроки(ПараметрыОтбора);
		Для каждого Стр из НайденныеСтроки Цикл
			Стр.Пользователи = ВыборкаНастроек.Пользователи;
		КонецЦикла;
	КонецЦикла;
	Запрос.УстановитьПараметр("ВидНастройки", ПредопределенноеЗначение("Перечисление.ВидыНастроекОткрытияМагазина." + ВидНастройки + "ДляВсехЗаИсключением"));
	ВыборкаНастроек = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНастроек.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Поле", ВыборкаНастроек.Поле);
		НайденныеСтроки = Объект.НастройкиПолейФормы.НайтиСтроки(ПараметрыОтбора);
		Для каждого Стр из НайденныеСтроки Цикл
			Стр.Пользователи = ВыборкаНастроек.Пользователи;
			Стр.Значение = Истина;
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры  //---АК SUVV
